package basic.day4;

public class review {
    /*
     * 1. 메소드 정의 - 왜 만드는 건가요?
     *      A.  자주 사용되는 기능을 main에서 분리시킨다.
     *          코드를 여러 번 작성하지 않고 재사용
     *
     *          (다른 언어에서 <함수>가 가지는 동작과 같은 동작을 함.)
     * 2. 메소드의 인자, 매개변수란 무엇인가요?
     *      A.  메소드의 실행에 필요한 입력값
     *          인자 argument : 둘 사이를 연결시켜준다. 
     *                          메소드 호출시 메소드 정의
     *          매개변수 : 선언된 변수() 안에서 선언된 변수 그 자체를 말합니다.
     *          인자 = 매개변수
     * 
     * 3. 메소드의 리턴은 무엇인가요?
     *      A. 메소드 실행 결과값
     * 
     * 4. static 메소드의 특징은 무엇인가요
     *      A.  클래스 이름으로 직접 호출(실행)
     *          예시: Character.isUpperCase(c), String.format("%d", val), Integer.valueOf
     *       (비교) 인스턴스 메소드는 객체를 만들어서 메소드를 호출
     *       (인스턴스 메소드 예시) message.length(), sc.nextInt()
     * 
     * 
     *  // 메소드는 인스턴트와 static 메소드로 분류할 수 있다.
     * 
     */

}
